//Приклад обробки масиву даних невідомого розміру
//// файл input.dat містить пари чисел (х,у), записані в стовпчик
//// знайти суму кожної пари, результат х+у записати в стовпчик у файл output.dat

#include <stdio.h>



int main(void)

{

    int n, sum;
    float x,y;
    FILE *fin, *fout; // оголошуємо два покажчики, оскільки одночасно доведеться працювати з двома файлами

    fin = fopen( "input.dat", "r" ); // відкрити файл на читання
    fout = fopen( "output.dat", "w" ); // відкрити файл на запис
    int i=0;
   // перевіка на відсутність помилок при відкритті файлів
    while ( 1 ) { // цикл до примусового виходу з нього
        n = fscanf ( fin, "%f%f", &x, &y ); // зчитуємо з файлу input.dat пару чисел, при цьому фіксуємо кількість вдало зчитаних чисел
        if ( n < 2 ) break; // якщо вдало зчитано менше, ніж 2 числа (кінець файлу або натрапили на некоректні дані) - примусовий вихід з циклу
        sum = x + y; // знаходимо суму зчитаної пари
        fprintf ( fout, "%d\n", sum ); // результат вносимо у файл output.dat
        printf("Save: %i\n",++i);
        }

    fclose ( fout ); // закриваємо
    fclose ( fin ); // обидва файли

}
