/*Складіть програму, яка б виконувала наступні дії:
1) прийняти з клавіатури два цілих числа (d1 - ділене і d2 - дільник);
2) перевірити їх на коректність: якщо d2==0, або одночасно d1== d2==0 - вивести відповідні повідомлення і повторити введення (повернутись на п.1);
3) розрахувати частку і остачу від їх ділення;
4) в залежності від того, чому дорівнює остача - вивести на екран d2 разів частку і в кінці - остачу (один раз) за допомогою різних циклів:
   - якщо остача == 1 - циклу з відомою кількістю повторень (for);
   - якщо остача == 2 - циклу з умовою (while);
   - якщо остача == 3 - циклу з післяумовою (do-while);
   - в іншому випадку - попросити повторно ввести ділене і дільник (перехід на п.1).
.*/
#include<stdio.h>
#include<windows.h>

main(){
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
	
	int d1, d2,ost,chast;
	int i;
	do{
			//перевірка на коректність: якщо d2==0, або одночасно d1== d2==0
		do{
			printf("Imput numbers A and B: ");
			scanf("%d%d", &d1, &d2);
			fflush(stdin);
			if(d2==0 || ((d1==d2) && d2==0)){
				printf("You can not divide by zero. ");
			}
		}
		while(d2==0);	
		
		chast=d1/d2; //частка
		ost=d1%d2; //остача
		
		switch(ost)
		{
			case 1: for(i=0; i<d2; i++){ //якщо остача == 1 - циклу з відомою кількістю повторень (for);
						printf("%d",chast);
					}
					printf("%d", ost);
					break;
			case 2: i=0;
					while(i<d2){ //якщо остача == 2 - циклу з умовою (while);
						printf("%d",chast);
						i++;
					}
					printf("%d", ost);
					break;
			case 3: i=0; //якщо остача == 3 - циклу з післяумовою (do-while);
					do{
						printf("%d",chast);
						i++;
					}
					while(i!= d2);
					printf("%d", ost);
					break;
		 	default: break;
		}
	}
	while(ost>3|| ost ==0);

}
