/*Напишіть функцію, яка має вхідні параметри A, B і N (цілі числа) і виконує наступне:
1) "розбирає" число B по цифрах (в циклі);
2) якщо поточна цифра дорівнює 0 - перехід на наступну ітерацію циклу (достроково);
3) підраховує остачу від ділення числа A на кожну поточну цифру числа B;
4) достроково припиняє цикл, коли кількість виконаних циклів перевищить задане число N;
5) знаходить і повертає суму результатів виконання п.3.
 
Вхідні змінні:
A: integer
B: integer
N: integer
Вихідний результат:
integer*/



#include<stdio.h>
#include<windows.h>
#include<math.h>

main(){
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
   int A, B, N;
    printf("Введіть два числа A and B: \n");
	scanf("%d%d", &A, &B);
	printf("\nВведіть N: ");
	fflush(stdin);//очищає лишній Enter
	scanf("%d", &N);
    
	int b=0;
	int count=0;
	int sum=0;
	if(B<0){B*=(-1);}
	do{
    if(count<=N){
    	
    	b=B%10; //"розбирає" число B по цифрах (в циклі);
    		B/=10;
    	if(b==0){continue;} //якщо поточна цифра дорівнює 0 - перехід на наступну ітерацію циклу (достроково);
   	
        count++; //збільшую лічильник на 1
        sum += A%b; //знаходить і повертає суму результатів виконання (підраховує остачу від ділення числа A на кожну поточну цифру числа B;)
        printf("\nb%d = %d", count, b);
        printf("\nB%d= %d", count, B);
        printf("\nsum%d= %d", count, sum);
    }
    else {break;} //достроково припиняє цикл, коли кількість виконаних циклів перевищить задане число N;
	}
while(B>0); //виконується до тих пір поки ...
	printf("\nСума чисел остачі від ділення числа A на кожну поточну цифру числа B = %d", sum); //Imput summa
}

