#include <stdio.h>


#define N 10
main()
{
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
int i, a[N];
int temp; // temp - тимчасова зм≥нна
	for(i=0; i<N; i++){
		printf("Input a[%d]: ",i);
		scanf("%d", &a[i]);
	} // вводимо масив a[N]
for ( i = 0; i < N/2; i ++ ) // оск≥льки за один прох≥д циклу переставл€ютьс€ одразу 2 зм≥нн≥ - к≥льк≥сть проход≥в циклу буде в 2 рази меншою розм≥рност≥ масиву
// €кщо N - непарне, то в≥дпов≥дно, середн≥й елемент просто залишитьс€ на м≥сц≥
{
temp = a[i]; // зм≥нн≥й temp присвоюЇмо одну ≥з зм≥нних, що п≥дл€гають перестановц≥
a[i] = a[N-1-i]; // м≥н€Їмо м≥сц€ми 1-й ≥ останн≥й елементи, пот≥м - 2-й ≥ передостанн≥й ≥ т.д.
a[N-1-i] = temp;
}
printf("\n –езультат: \n");
for ( i = 0; i <N; i ++ )
printf("%d ", a[i]); // виводимо ≥нвертований масив
}


