/*Приклад циклічного зсуву елементів масиву
// зсув вправо: кожен елемент зсувається (перезаписується) на сусідню комірку (з номером, більшим на 1), а останній - на місце першого
// зсув вліво: кожен елемент зсувається (перезаписується) на сусідню комірку (з номером, меншим на 1), а перший - на місце останнього
*/
#include <stdio.h>


#define N 10
main()
{
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);


int i,j, a[N];
int temp; // тимчасова змінна
	for(i=0; i<N; i++){
		printf("Input a[%d]: ",i);
		scanf("%d", &a[i]);
	} // вводимо масив a[N]
// реалізуємо зсув вправо
for (j=0; j<2; j++){

temp = a[0]; // запaм'ятаємо останній елемент
// пам'ятаймо! перший елемент позначається a[0], тому останній буде a[N-1]
for ( i = 0; i < N-1; i ++ ) // перебираємо елементи, починаючи з кінця масиву
a[i] = a[i+1]; // поточному елементу присвоюємо попередній, і так - до самого початку масиву
a[N-1] = temp; // першому елементу присвоюємо значення останнього
}
printf("\n Результат: \n");
for ( i = 0; i < N; i ++ )
printf("%d ", a[i]); // виводимо результат перестановки
}



