/*Напишіть функцію, що має вхідним параметром масив цілих чиселmas[20] i реалізує наступні дії:
1) переписує послідовно числа з масиву mas[20] у масив matr[5][4] (починаючи з елемента matr[0][0] і далі по рядках);
2) обхід елементів масиву matr[5][4], починаючи з останнього рядка;
3) множення кожного елемента масиву matr[5][4] на відповідний елемент, що стоїть рядком вище (крім елементів першого рядка);
4) перезаписує масив matr[5][4] назад у масив mas[20] (починаючи з елемента matr[0][0] і далі по рядках);
5) повертає (через return) змінений масив mas[20].*/


 
#include <stdio.h>
// визначаємо константи розмірності масиву:
#define M 2 // кількість рядків
#define N 3 // кількість стовпчиків
main()
{
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    
	int i, j,k; // лічильники рядків і стовпчиків
	int  matr[5][4]; // двовимірний масив
	int row, col;
	row = col = 0;
	int arr[20]= {1,2,3,4,5,6,7,8,47,10,11,12,13,14,15,16,17,18,19,20};
	//переписує послідовно числа з масиву arr[20] у масив matr[5][4]
	for(i=0,k=0;i<5, k<20;i++){
		for(j=0; j<4;j++){
			matr[i][j]=arr[k];
			k++;
		}
	}
	//виведення на екран масив matr[5][4]
	for(i=0;i<5;i++){
		for(j=0; j<4;j++){
			printf("%4d ", matr[i][j]);
		}
		printf("\n");
	}
	//знаходження максимального елемента масиву matr[5][4] на відповідний елемент, що стоїть рядком вище (крім елементів першого рядка);
	for(i=0; i<5; i++){
		for(j=0; j<4; j++){
			if(matr[i][j]>matr[row][col]){
				row=i;
				col=j;
			}
		}
	}
	
	//виведення на екран масив matr[5][4]
	printf("\n\n");
	printf("max = %d", matr[row][col]);

//	getchar();
	

}

