//риклад введення-виведення елементів двовимірного масиву
 
#include <stdio.h>
// визначаємо константи розмірності масиву:
#define M 2 // кількість рядків
#define N 3 // кількість стовпчиків
main()
{
SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
int i, j; // лічильники рядків і стовпчиків
int a[M][N]; // двовимірний масив
 
for ( i = 0; i < M; i ++ ) // цикл по рядках
for ( j = 0; j < N; j ++ ) { // цикл по стовпчиках
printf ("a[%d][%d]=", i, j); // підказка для вводу
scanf ("%d", &a[i][j]); // вводимо елемент a[i][j]
}
printf("Матриця a: \n");
for ( i = 0; i < M; i ++ ) {
for ( j = 0; j < N; j ++ )
printf ( "%4d", a[i][j] ); // виводимо елементи j-го рядка
// %4d - виділяємо на екрані місце величиною 4 символи на число (для рівного розташування чисел у стовпчиках)
printf("\n"); // переводимо курсор на наступний рядок
}
getchar();
}


