/*Складіть програму, яка б виконувала наступні дії:
1) заповнює числами деякий двовимірний масив;
2) приймає з клавіатури номери одного рядка і одного стовпчика;
3) перевіряє, чи кількість рядків і стовпчиків у масиві однакова;
4) якщо кількість однакова - міняє місцями відповідні елементи вибраних рядка і стовпчика;
5) якщо кількість неоднакова - встановлює менше з цих двох величин(кількість рядків і стовпчиків) і міняє місцями відповідну кількість елементів у вибраному рядку і стовпчику.
Примітки: а) елементи, що знаходяться на перетині вибраних рядка і стовпчика, обміну не підлягають (залишаються на місці);
б) зважаючи на попередню примітку, на місці залишаються також тіелементи, які після можливого обміну мали б стати на місце перетину рядка і стовпчика.
Наприклад, в масиві arr 4 рядки і 5 стовпчиків; вибрано 2-й рядок і 4-й стовпчик; оскільки 4 менше 5 - міняємо місцями всі елементи 4-го стовпчика з першими 4-ма елементами 2-го рядка). При цьому елемент arr[2][4] є "недоторканим", так само, як елементи arr[2][2] іarr[4][4].
*/


 
#include <stdio.h>
#include <stdlib.h>//для випадкових чисел
// визначаємо константи розмірності масиву:
#define M 4 // кількість рядків
#define N 4 // кількість стовпчиків
main()
{
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    
    srand(time(NULL));//функцію srand , яка в якості аргументу просить число для випадкових чисел
    
	int i, j,k; // лічильники рядків і стовпчиків
	
	int  matr[M][N]; // двовимірний масив
	int row, col;
	row = col = 0;
	
	int temp;
	
	for(i=0;i<M;i++){//заповнює числами деякий двовимірний масив;	
		for(j=0;j<N;j++){
			int rd=rand() % 100;	
			matr[i][j]=rd;
		}
	}
	//Перевірка виведення, щоб не перевищувало кількіст рядків і стовпчиків
	do{
		printf("Enter numbers of one line(1-%d): ",M);//приймає з клавіатури номери одного рядка і одного стовпчика;
		scanf("%d",&row);
		printf("Enter numbers of one column(1-%d): ",N);
		scanf("%d",&col);
		
	}
	while(row>M || col>N || row<1||col<1);
	
		//Перевірка виведення на екран заповненого масив matr[M][N] для наочності
	for(i=0;i<M;i++){
		for(j=0; j<N;j++){
			printf("%4d ", matr[i][j]);
		}
		printf("\n");
	}
	printf("\n");printf("\n");
	
	//3) перевіряє, чи кількість рядків і стовпчиків у масиві однакова;
    //) якщо кількість однакова - міняє місцями відповідні елементи вибраних рядка і стовпчика;
	if(row==M && col==N){
		for(i=0; i<M; i++){
			temp=matr[row-1][i];
			matr[row-1][i]=matr[i][col-1];
			matr[i][col-1]=temp;
		}
	}
	//5) якщо кількість неоднакова - встановлює менше з цих двох величин(кількість рядків і стовпчиків) і міняє місцями відповідну кількість елементів у вибраному рядку і стовпчику.
	else{
	//встановлює менше з цих двох величин(кількість рядків і стовпчиків)
		if(M<N){
			for(i=0; i<M;i++){
			//міняє місцями відповідну кількість елементів у вибраному рядку і стовпчику.
					if(matr[row-1][col-1]==matr[row-1][i]||matr[row-1][col-1]==matr[i][col-1]){
					//Примітки: а) елементи, що знаходяться на перетині вибраних рядка і стовпчика, обміну не підлягають (залишаються на місці);
						continue;
					}
			temp=matr[row-1][i];
			matr[row-1][i]=matr[i][col-1];
			matr[i][col-1]=temp;
			
			
			}
		
		}
		else{
				for(j=0; j<N;j++){
					if(matr[row-1][col-1]==matr[row-1][j]||matr[row-1][col-1]==matr[j][col-1]){
						continue;
					}
			temp=matr[j][row-1];
			matr[j][row-1]=matr[row-1][j];
			matr[row-1][j]=temp;
		}
	}


	}
	//виведення на екран масив matr[5][4]
	for(i=0;i<M;i++){
		for(j=0; j<N;j++){
			printf("%4d ", matr[i][j]);
		}
		printf("\n");
	}
	printf("\n");printf("\n");
	getchar();
}

