#include <stdio.h>

int main()
{
    printf("Hello World!\n");
    return 0;
}
int PopHead ( Quere *Q ) // функція видалeння вузла з початку черги

{
    PNode TopNode = *Q.Head; // покажчик на початок черги
    int x;
    if ( ! TopNode ) // якщо черга пуста (TopNode==NULL) -
    return 0; // то повернути число 0
    x = TopNode->data; // отримуємо число з початку черги
    *Q.Head = TopNode->next; // пересуваємо покажчик початку черги на наступний вузол
    // якщо вузлів у черзі більше немає - Q.Head прийме значення NULL
    if (*Q.Head ) // якщо черга не залишилася пуста -
    *Q.Head->prev = NULL; // “обнуляємо” покажчик prev вузла, який став початком черги
    else *Q.Tail = NULL; // інакше - “обнуляємо” також покажчик на кінець черги
    free(TopNode); // звільняємо пам’ять від крайнього елемента TopNode
    return x; // повертаємо в основну програму число з початку черги

}
