//Напишіть програму, яка виконує наступне:
//1) приймає з клавіатури два цілих числа;
//2) передає їх за посиланням у функцію Mul();
//3) функція Mul() інкрементує отримані аргументи (змінні з іншими іменами!) і перемножує їх;
//4) результат функції Mul() передається в основну програму з виведенням на екран у вигляді виразу
//(наприклад, з клавіатури прийнято a=7 i b=3; на екрані повинно з'явитися 8*4=32).
#include <stdio.h>
#include <conio.h>

int Mul(int &c, int &d){
    ++c;
    ++d;
    return c *d;
}
int main()
{
    //int Mul(int c, int d);
    int a,b;
    int dob=0;
    printf("Inpun two numbers:  \n");
    scanf("%i%i",&a,&b);

    dob = Mul(a,b);
    printf("\n%i * %i = %i\n",++a,++b, dob);
    return 0;
}


