#include <stdio.h>

#define N 10 // розмірність масиву (кількість чисел у файлі)



int main(void)

{

    int i, k=0, a[N];

    FILE *fp; // покажчик на файл



    fp = fopen( "input.dat", "r" ); // відкриваємо файл в режимі читання
    if ( fp == NULL ) { // якщо файл не існує -
        printf("File is not found\n");
        return; // вихід з програми (функції main())
    }

    for ( i = 0; i < N; i ++ ) { // якщо файл відкрився успішно -
        if ( 0 == fscanf(fp, "%d", &a[i]) ) { // по черзі читаємо з нього числа і записуємо в масив, якщо натрапляємо на кінець файлу або нечислові дані (не відповідають формату %d, відповідно функція fscanf() повертає кількість вдало зчитаних даних 0) -
            printf("The data in the file is missing");
            break; // виходимо з циклу (завершуємо читання)
        }
        k++;  // підраховуємо кількість зчитаних даних
    }

    fclose ( fp ); // закриваємо файл
    for ( i = 0; i < k; i ++ ) // опрацьовуємо дані масиву
        a[i] = a[i]*2;

    fp = fopen( "output.dat", "w" ); // відкриваємо інший файл в режимі запису
        for ( i = 0; i < k; i ++ ) // по черзі записуємо в нього всі елементи масиву
           fprintf (fp, "%d\n", a[i] ); // в стовпчик (за допомогою \n)
        fclose ( fp ); // закриваємо поточний файл

}
