#include <stdio.h>
#include <conio.h>

int main()
{
    long int a;//буде розміщений зчитаний з файлу байт
    FILE *fbin=NULL;
    fbin =fopen("input.gif", "rb");//встановити зв’язок з вибраним файлом
    if(fbin == NULL){// Перевірка відкриття файлу
        printf("Ops... Error opening file.\n");
        getch();
        return -2;
    }
    else  printf("File open\n");

//встановити покажчик поточної позиції у файловому потоці на початок, вивести його значення на екран;
    fseek(fbin,0,SEEK_SET);// Встановлення поточної позиції на початок файлу
    //rewind(fbin);//виклик цієї функції аналогічний (попередньому запису)(крім скидання індикатора помилок)
    printf ("Read position \n");
    a = ftell(fbin);
    if(a ==-1)//Якщо при визначенні позиції сталася помилка, то повертається -1
        printf("Error\n");
    else printf("%ld\n",a);//виводить на екран поточну позицію

//перемістити покажчик вперед на довжину (кількість байт) змінної a (початок відліку - SEEK_CUR)
    fseek(fbin,(long)sizeof(a),SEEK_CUR);
    printf ("Read next position \n");
    a = ftell(fbin);
    if(a ==-1)
        printf("Error\n");
    else printf("%ld\n",a);
/*
 * перемістити покажчик вперед на довжину змінної a (початок відліку - SEEK_SET),
 * вивести на екран поточну позицію (результат порівняти з попереднім, зробити висновки);
 */
    fseek(fbin,(long)sizeof(a),SEEK_SET);
    printf ("Read next position \n");
    a = ftell(fbin);
    if(a ==-1)
        printf("Error\n");
    else printf("%ld\n",a);
/*------------------------------------------------------------------------------------------------|
 *Висновок 1: Початкова позиція  0 командою SEEK_CUR(від поточної позиції, а саме від 0)
 * перемістив покажчик вперед на довжину (кількість байт) змінної a
 * тобто на  4 байта. SEEK_SET переміщує покажчик вперед від початку файлу, тобто
 * зробили теж саме що і попередній раз, покажчик перемістили з 0 до 4 (кількість байт) змінної a.
 *------------------------------------------------------------------------------------------------|
 */

 /*
  * перемістити покажчик назад на довжину змінної a (початок відліку - SEEK_CUR),
  * виводить на екран поточну позицію (результат порівняти з отриманими раніше, зробити висновки).
  */
    fseek(fbin,-(long)sizeof(a),SEEK_CUR);
    printf ("Read next position \n");
    a = ftell(fbin);
    if(a ==-1)
        printf("Error\n");
    else printf("%ld\n",a);
 /*----------------------------------------------------------------------------------------------|
  * Висновок 2: Так як SEEK_CUR переміщення від поточної позиції (4 -(кількість байт) змінної a),
  * а (-(long)sizeof(a)) переміщення назад від поточної позиції на кількість байт в комірці а.
  * Тому ми знову повернули покажчик на початок п позицію 0.
  * ---------------------------------------------------------------------------------------------|
  */
    fclose(fbin);//Закриваю файл
    return 0;
}
