//Реалізуйте рекурсивну функцію NumNum() для пошуку повторень деякого цілого числа в масиві.
//Особливості функції:
//1) знаходить номер першої появи потрібного числа в масиві
//   (якщо не знайдено - вихід з функції);
//2) повертає значення: 1+<кількість повторень в "недослідженій" частині рядка>;
//(рекурсивний виклик)
//3) параметри функції: номер елемента, наступного за знайденим
//(при першому виклику з головної програми - 0); значення шуканого елемента
#include <stdio.h>
#define N 10
int NumNum(int *arr[], int n);
int main()
{
    int arr[N]= {1,2,3,4,5,6,7,5,9,10};
    //int k = 0;//номер елемента
    int p=0; //кількість повторень
    p = NumNum(&arr, 5);
    printf("%i\n", p);

    return 0;
}
/* Я не розумію для чого використовувати рекурсію в даному завданні, якщо
 * в першій умові вказано  (якщо не знайдено - вихід з функції), тобто повне
 * проходження по масиву, а чому при цьому ж проходженні і знайти кількість повторень
 * деякого шуканого елемента.
*/
int NumNum(int *arr[], int n){//n - шуканий елемент
    int p=0;
    for(int i = 0; i<N; i++){//
        if(arr[i] == n){
            p++;
        }
    }

     return p;
}



