//Складіть програму для виконання наступних дій:
//1) оголошується покажчик int* sum; (для роботи з динамічним масивом);
//2) створюється рекурсивна функція побудови ряду натуральних чисел до певного граничного значення їх суми;
//3) створюється динамічний масив розмірністю N (кількість натуральних чисел в побудованому ряді);
//4) масив заповнюється величинами: sum[i]=(i+1)+sum[i-1]; де (i+1) - чергове натуральне число,
//sum[i-1] - сума попередніх чисел натурального ряду.
#include <iostream>
int n =2;int summa=1;
using namespace std;
void Natural (int N);

int main()
{
    int N, *pN;

    int *psumma = &summa;
    int *sum;
    cin >> N;
    cout << summa << endl;
    return 0;
}
void Natural (int n)
{
    if  (n > 1)
        Natural (n - 1) ;
    cout  << n <<  " ";
}
