#include <iostream>

using namespace std;

int main()

{

int i,N;     // N - розмір масиву

int* mas; // ідентифікатор масиву



cout << "Size of array: ";

cin >> N;                // вводимо розмір масиву (обов’язково більше нуля!)

mas = new int [N]; // ініціалізація ідентифікатора і виділення пам’яті

if (mas==NULL) { // перевірка на успішність виділення пам’яті

cout << "Memory allocation error!";

return 1;          // вихід з програми в разі збою виділення пам’яті

}

for (i=0; i<N; i++) {

cout << "mas[" << i << "]="; // вводимо елементи масиву з клавіатури

cin >> mas[i]; // до кожного елемента динамічного масиву звертаємось, як і до звичайного статичного

}

//…                       // працюємо з масивом

delete [ ] mas;    // звільняємо виділену пам’ять по завершенні використання масиву

     return 0;

} // при цьому значення покажчика mas не змінюється! (але використовуватися він вже не може - при необхідності потрібна переініціалізація)
